# coding: utf-8
def map(a):
    A = ['2100101', '2100102', '2100103', '2100104', '2050101', '2060101', '2060108', '2060201', '2090101', '2090102']
    B = ['2050101', '2050102', '2050103', '2050104', '2060308', '2060309', '2060310', '2050303', '2060202', '2060203']
    C = ['2080101', '2080102', '2080105', '2080107', '2070101', '2070201', '2070301', '2070401']
    CODING = {"A":"防疫性空间","B":"疗愈性空间","C":"保障性空间","A1":"医疗服务设施","A2":"避难收容设施","A3":"临时收容设施","B1":"自然接触设施","B2":"需求供给设施","B3":"灵修陶冶设施","B4":"体育锻炼设施","C1":"交通保障设施","C2":"生活保障设施",}
    if a in A:
        data = CODING["A"]
    if a in B:
        data = CODING["B"]
    if a in C:
        data = CODING["C"]
    return data

def Type(a):
    A1 = ['2070401', '2070401', '2070401', '2070401']
    A2 = ['2070401']
    A3 = ['2070401', '2070401', '2070401', '2070401', '2070401']
    B1 = ['2070401', '2070401', '2070401', '2070401']
    B2 = ['2070401', '2070401', '2070401']
    B3 = ['2070401']
    B4 = ['2070401', '2070401']
    C1 = ['2070401', '2070401', '2070401', '2070401']
    C2 = ['2070401', '2070401', '2070401', '2070401']
    CODING = {"A":"防疫性空间","B":"疗愈性空间","C":"保障性空间","A1":"医疗服务设施","A2":"避难收容设施","A3":"临时收容设施",
                "B1":"自然接触设施","B2":"需求供给设施","B3":"灵修陶冶设施","B4":"体育锻炼设施",
                "C1":"交通保障设施","C2":"生活保障设施",}
    if a in A1:
        Type = CODING["A1"]
    if a in A2:
        Type = CODING["A2"]
    if a in A3:
        Type = CODING["A3"]
    if a in B1:
        Type = CODING["B1"]
    if a in B2:
        Type = CODING["B2"]
    if a in B3:
        Type = CODING["B3"]
    if a in B4:
        Type = CODING["B4"]
    if a in C1:
        Type = CODING["C1"]
    if a in C2:
        Type = CODING["C2"]
        
    return Type

a = "2070401"
print (Spatial(a))
print (Type(a))

